cmsis-svd/cmsis-svd/data/GigaDevice/GD32F403.svd
        <register>
          <name>CFG1</name>
          <displayName>CFG1</displayName>
          <description>Clock Configuration register 1</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PREDV0</name>
              <description>PREDV0 division factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PREDV1</name>
              <description>PREDV1 division factor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PLL1MF</name>
              <description>The PLL1 clock multiplication factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PLL2MF</name>
              <description>The PLL2 clock multiplication factor</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PREDV0SEL</name>
              <description>PREDV0 input Clock Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S1SEL</name>
              <description>I2S1 Clock Source Selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S2SEL</name>
              <description>I2S2 Clock Source Selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCPSC_3</name>
              <description>Bit 4 of ADCPSC</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>PLLPRESEL</name>
              <description>PLL Clock Source Selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>PLL2MF_4</name>
              <description>Bit 5 of PLL2MF</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSV</name>
          <displayName>DSV</displayName>
          <description>Deep sleep mode Voltage register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DSLPVS</name>
              <description>Deep-sleep mode voltage select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>  
        <register>
          <name>ADDCTL</name>
          <displayName>ADDCTL</displayName>
          <description>Additional clock control register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>CK48MSEL</name>
              <description>48MHz clock selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC48MEN</name>
              <description>Internal 48MHz RC oscillator enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC48MSTB</name>
              <description>Internal 48MHz RC oscillator clock stabilization Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRC48MCALIB</name>
              <description>Internal 48MHz RC oscillator calibration value register</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

       <register>
          <name>ADDINT</name>
          <displayName>ADDINT</displayName>
          <description>Additional clock interrupt register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRC48MSTBIF</name>
              <description>IRC48M stabilization interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IRC48MSTBIE</name>
              <description>Internal 48 MHz RC oscillator Stabilization Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRC48MSTBIC</name>
              <description>Internal 48 MHz RC oscillator Stabilization Interrupt Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>ADDAPB1RST</name>
          <displayName>ADDAPB1RST</displayName>
          <description>APB1 additional reset register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCRST</name>
              <description>CTC reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      <register>
          <name>ADDAPB1EN</name>
          <displayName>ADDAPB1EN</displayName>
          <description>APB1 additional enable register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCEN</name>
              <description>CTC clock enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>     
